#!/usr/bin/env python
# -*- coding: utf-8 -*-

import sys 
reload(sys) 
sys.setdefaultencoding("utf-8")
import re
import unicodedata
MAP 					= {'Ἄ': 'Ά',
                        'Ἀ': 'Α',
                        'ᾈ': 'Α',
                        'ᾉ': 'Ά',
                        'ᾊ': 'Ά',
                        'ᾋ': 'Ά',
                        'ᾌ': 'Ά',
                        'ᾍ': 'Ά',
                        'ᾎ': 'Α',
                        'ᾏ': 'Α',
                        'Ὃ': 'Ό',
                        'Ὄ': 'Ό',
                        'ἁ': 'α',
						'ἀ': 'α',
						'ᾶ': 'α',
						'ἂ': 'ά',
                        'ᾀ': 'ά',
                        'ᾁ': 'α',
                        'ἅ': 'ά',
                        'ᾃ': 'ά',
                        'ᾄ': 'ά',
                        'ἄ': 'ά',
                        'ἆ': 'α',
                        'ἇ': 'α',
                        'ἡ': 'η',
                        'ῆ': 'η',
                        'ᾐ': 'η',
                        'ᾑ': 'η',
                        'ᾒ': 'η',
                        'ᾓ': 'ή',
                        'ᾔ': 'ή',
                        'ᾕ': 'ή',
                        'ᾖ': 'ή',
                        'ᾗ': 'ή',
                        'ἦ': 'ή',
                        'ἐ': 'ε',
                        'ἑ': 'ε',
                        'ἔ': 'έ',
                        'ἕ': 'έ',
                        'ὲ': 'έ',
                        'έ': 'έ',
                        'ἰ': 'ι',
                        'ἱ': 'ι',
                        'ἴ': 'ί',
                        'ἵ': 'ι',
                        'ἷ': 'ι',
                        'ἶ': 'ι',
                        'ῖ': 'ι',
                        'ὐ': 'υ',
                        'ὑ': 'υ',
                        'ὔ': 'ύ',
                        'ὕ': 'ύ',
                        'ῦ': 'υ',
                        'ὖ': 'υ',
                        'ὀ': 'ο',
                        'ὁ': 'ο',
                        'ὄ': 'ό',
                        'ὅ': 'ό',
                        'ὃ': 'ό',
                        'ᾘ': 'Ή',
                        'ᾙ': 'Η',
                        'ᾚ': 'Ή',
                        'ᾛ': 'Ή',
                        'ᾜ': 'Ή',
                        'ᾝ': 'Ή',
                        'ᾞ': 'Η',
                        'ᾟ': 'Η',
                        'Ἥ': 'Ή',
                        'ῌ': 'Η',
                        'ῂ': 'ή',
                        'ῃ': 'η',
                        'ῄ': 'ή',
                        'ῇ': 'η',
                        'ἤ': 'ή',
                        'ἥ': 'ή',
                        'ἣ': 'ή',
                        'ᾕ': 'η',
                        'ᾔ': 'η',
                        'ᾠ': 'ω',
                        'ᾡ': 'ω',
                        'ᾢ': 'ώ',
                        'ᾣ': 'ώ',
                        'ὤ': 'ω',
                        'ὥ': 'ώ',
                        'ὣ': 'ώ',
                        'ᾥ': 'ώ',
                        'ὦ': 'ω',
                        'ὧ': 'ω',
                        'ῶ': 'ω',
                        'ῥ': 'ρ',
                        'ῤ': 'ρ',
                        'ᾨ': 'Ω',
                        'ᾩ': 'Ω',
                        'ᾪ': 'Ώ',
                        'ᾫ': 'Ώ',
                        'ᾬ': 'Ώ',
                        'Ὦ': 'Ω',
                        'ᾭ': 'Ώ',
                        'ᾮ': 'Ω',
                        'ᾯ': 'Ω',
                        'ᾲ': 'ά',
                        'ᾳ': 'α',
                        'ᾴ': 'ά',
                        'ᾷ': 'α',
                        'ἀ': 'α',
                        'ᾼ': 'Α',
                        'Ά': 'Ά',
                        'Ἑ': 'Ε',
                        'Ἐ': 'Ε',
                        'ῲ': 'ώ',
                        'ῳ': 'ω',
                        'ῴ': 'ώ',
                        'ῷ': 'ω',
                        'ὤ': 'ώ',
                        'ὥ': 'ώ',
                        'ᾥ': 'ώ',
                        'ᾢ': 'ώ',
                        'ῶ': 'ω',
                        'ῼ': 'Ω',
                        'Ἰ': 'Ι',
							}
        
def convert_polytonic_to_monotonic(s):
	mono_str = []
	for c in s:
		for ch in MAP:
			if ch == c:
				c=MAP[ch]		
		mono_str.append(c)
	return ''.join(mono_str)
	
	
def main(args):
	coding1 = "utf-8"
	if len(sys.argv) >=3:
		f= open(sys.argv[1], 'rb')
		text= unicode(f.read(), coding1)
		f.close()

		f= open(sys.argv[2], 'wb')
		f.write(convert_polytonic_to_monotonic(text))
		f.close()
	else:
		#Δοκιμή
		text=unicode("Ὦ κοινὸν αὐτάδελφον Ἰσμήνης κάρα,")
		print(convert_polytonic_to_monotonic(text))
    

if __name__ == '__main__':
	import sys
	sys.exit(main(sys.argv))
